Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_to_ireland/visas_for_tourists_visiting_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Visas for tourists visiting Ireland
ga: Víosaí do thurasóirí ag teacht go hÉirinn

source: Citizens of certain countries must apply for an entry visa before they travel to Ireland
ga: Ní mór do shaoránaigh ó thíortha áirithe iarratas a dhéanamh ar víosaí iontrála sula dtaistealaíonn siad go hÉirinn

source: Information on those who need an entry visa is available in our document: Visa requirements for entering Ireland
ga: Tá an fhaisnéis ar iad siúd nach bhfuil gá le víosa iontrála ar fáil sa doiciméad: Riachtanais víosa le teacht isteach in Éirinn

source: If you require a visit/holiday visa and do not have one when you arrive in Ireland, you will not be allowed to enter the country
ga: Má tá sé riachtanach go mbeadh víosa cuairte/saoire agat le teacht go hÉirinn ní ligfear isteach sa tír tú mura mbíonn ceann agat nuair a thagann tú

source: A visit/holiday visa is for a short-term stay and will not exceed a maximum of 90 days
ga: Is éard atá i víosa cuairte/saoire ná víosa le fanacht ar feadh achair bhig nach faide ná 90 lá é

source: If you are a citizen of an EU/EEA member state or Switzerland, you do not require a visit/holiday visa to travel to Ireland. You have the right to enter and reside in Ireland for a period of up to 3 months simply by presenting a valid passport or national identity card; no other formality is required
ga: Ní bheidh víosa cuairte/saoire riachtanach le teacht go hÉirinn más saoránach de chuid an AE/LEE tú.Tá sé de cheart agat a iontráil agus cónaí iontu ar feadh tréimhse uasta trí mhí ach pas bailí nó cárta náisiúnta aitheantais a sholáthar; ní theastaíonn aon ghnás foirmiúil eile

source: There is no additional conditions concerning the minimum validity of duration of the identity card or passport
ga: Níl aon coinníollacha breise maidir le bailíocht íosta thréimhse an chárta aitheantais nó an phas

source: The members of the EEA are the 28 countries of the European Union (EU), together with Iceland, Norway and Liechtenstein)
ga: (Is iad 28 tír an Aontais Eorpaigh (AE) mar aon leis an Íoslainn, an Iorua, agus Lichtinstéin na tíortha LEE)

source: There is information for non-EEA nationals applying for a short-stay visa to accompany or join an EU citizen family member in Ireland on the Irish Naturalisation & Immigration Service (INIS) website
ga: Tá faisnéis do náisiúnaigh neamh-LEE a dhéanann iarratas ar víosa gearrchónaí chun ball teaghlaigh saoránaigh AE a ghabh le nó a chomhcheangal in Éirinn ar fáil sa suíomh gréasáin SEIÉ

source: Even if you do not require a visa to enter Ireland, all non-EEA nationals must obtain permission to enter the State by reporting to an Immigration Officer at the port of entry
ga: Fiú mura dteastaíonn víosa uait chun Éire a iontráil, caithfidh gach náisiúnach neamh-LEE cead a fháil chun an Stát a iontráil trí chasadh le hOifigeach Inimirce ag an bport iontrála

source: You should have supporting documentation relating to the purpose of your visit (see below)
ga: Ba cheart go mbeadh cáipéisíocht tacaíochta agat a bhaineann le cuspóir do chuairte (féach thíos)

source: The Short Stay Visa Waiver Programme allows nationals of a number of Eastern European, Middle East and Asian countries who have a short-term UK visa to come to Ireland without the need for a separate Irish visa
ga: Ceadaíonn an Clár Tarscaoilte Víosa Gearrchuairte do náisiúnaigh líon tíortha in Oirthear na hEorpa, an Meánoirthear agus san Áise a bhfuil víosa gearrthéarma RA acu chun teacht go hÉirinn gan víosa Éireannach ar leith a bheith ag teastáil uathu

source: This programme has been extended to 31 October 2021
ga: Síntear an clár seo go dtí 31 Deireadh Fómhair 2021

source: The British Irish Visa Scheme applies to visitors from China since 20 October 2014 and to visitors from India since 9 February 2015
ga: Ón 13 Deireadh Fómhair 2014, faoi Scéim nua Víosa na Breataine-na hÉireann (BIVS), féadfaidh cuairteoirí ón tSín taisteal gan srian laistigh den Chomhlimistéar Taistil, (is é sin, Éire agus an RA, lena n-áirítear Tuaisceart Éireann), agus víosa gearrchuairte na hÉireann nó an RA atá formhuinithe le ‘BIVS’ a úsáid

source: This scheme allows visitors from these countries to travel freely within the Common Travel Area (in this case, Ireland and the UK but not the Channel Islands and the Isle of Man), using either an Irish or UK visa
ga: Oibrítear an Scéim trí shocrú cómhalartach víosa, ina n-aithníonn Éire agus an RA víosaí gearrchuairte a d’eisigh an tír eile go ndéanfaidh daoine taisteal chuig a ndlínse

source: Documentation required for all visa applications
ga: Cáipéisí riachtanacha le haghaidh gach iarratas ar víosa

source: The following information describes the minimum documentation that you must provide with any visa application
ga: Is éard atá sa bhfaisnéis seo a leanas ná cuntas ar an gcáipéisíocht is lú a chaithfidh tú a chur ar fáil le hiarratas ar víosa

source: If any of this documentation is missing your application will be refused
ga: Diúltófar do d’iarratas má bhíonn aon cheann de na cáipéisí seo ar iarraidh

source: All documents must be in English
ga: Ní mór gach cáipéis a bheith as Béarla

source: If any document is in another language, you must provide a notarised translation as well as the original document
ga: Má tá aon cháipéis i dteanga eile caithfidh tú aistriúchán deimhnithe ag nótaire a sholáthar mar aon leis an gcáipéis bhunaidh

source: For the particular documentation needed for a tourist visa, see information headed 'Travelling to Ireland as a tourist', below
ga: Féach ar an bhfaisnéis faoin teideal ‘Taisteal go hÉirinn mar thurasóir’, thíos le fáil amach faoin gcáipéisíocht faoi leith atá ag teastáil le haghaidh víosa turasóra

source: • You must complete all sections of the application form
ga: • Ní mór duit gach cuid den fhoirm iarratais a chomhlánú

source: • You must sign the form yourself
ga: • Caithfidh tú an fhoirm a shíniú tú féin

source: The only exception is for children under 18 - the parent(s) may sign in this case
ga: Níl ach an t-aon eisceacht amháin ann - féadfaidh an tuismitheoir/na tuismitheoirí í a shíniú i gcás leanaí faoi bhun 18

source: • If a child (under 18 years of age) is travelling alone, both parents/guardians must have given consent
ga: • Má tá leanbh (faoi bhun 18 mbliana d’aois) le taisteal ina (h)aonair ní mór don bheirt thuismitheoirí/chaomhnóirí cead a thabhairt

source: If the child is travelling with one parent, the consent of the other parent is required
ga: Má tá an leanbh le taisteal le tuismitheoir amháin tá cead an tuismitheora eile riachtanach

source: Where only one parent has total custody and access rights, you must provide official evidence of this
ga: Má tá caomhnóireacht iomlán agus gach cead rochtana ag tuismitheoir amháin, ní mór duit fianaise oifigiúil a sholáthar faoi

source: • You must have a passport which is valid for a period lasting at least 6 months after the date you propose to leave Ireland
ga: • Ní mór duit pas a bheith agat a bheidh bailí ar feadh tréimhse 6 mhí ar a laghad ón dáta sin a bhfuil sé ar intinn agat Éire a fhágáil

source: • You must be able to prove that you can support yourself for the duration of your stay in Ireland
ga: • Ní mór duit a bheith in ann a chruthú gur féidir leat tú féin a chothú fad a bheidh tú in Éirinn

source: A detailed bank statement, covering the 6 months before you apply for the visa, and showing sufficient funds, is required
ga: Ní mór ráiteas mionsonraithe bainc a sholáthar maidir leis na 6 mhí sin sula gcuireann tú isteach ar víosa, agus a léireoidh go bhfuil airgead go leor agat

source: • You must provide details of any members of your family who are in Ireland or any other EU country
ga: • Caithfidh tú sonraí a thabhairt faoi bhaill do theaghlaigh atá in Éirinn nó in aon tír eile de chuid an AE

source: • You must also give details of any previous applications that you have made for a visa to enter Ireland
ga: • Caithfidh tú sonraí a sholáthar faoi aon iarratas a rinne tú cheana le víosa a fháil le teacht go hÉirinn

source: Travelling to Ireland as a tourist
ga: Taisteal go hÉirinn mar thurasóir

source: If you will be visiting Ireland for a short period (less than 3 months) and you require a visa, you must present the following documents with your completed and signed visa application form:
ga: Má tá sé ar intinn agat teacht go hÉirinn ar feadh achair ghearr (níos lú ná 3 mhí), agus má tá sé riachtanach duit víosa a fháil, caithfidh tú na cáipéisí seo a leanas a sholáthar le d’iarratas sínithe ar víosa:

source: • Full details of the reason for your visit - for example to see friends or family
ga: • Sonraí iomlána faoi chúis na cuairte - le bualadh le do chairde nó le do theaghlach, mar shampla

source: • If you plan to stay in a hotel, you will need written confirmation of the hotel booking containing the dates of your proposed stay
ga: • Má tá sé ar intinn agat fanacht in óstán, beidh deimhniú i scríbhinn ag teastáil faoi óstán a bheith curtha in áirithe duit, agus dátaí do thurais le léamh inti

source: • A letter from a reference in Ireland inviting you to come to Ireland
ga: • Litir ó theisteoir in Éirinn ag tabhairt cuireadh duit teacht go hÉirinn

source: The letter should include contact details for the reference, proposed dates for your stay and details of where you will be staying during your visit
ga: Ba chóir go mbeadh sonraí teagmhála an teisteora sa litir, na dátaí a bhfuil sé ar intinn agat fanacht sa tír, agus sonraí faoin áit (na háiteanna) ina bhfanfaidh tú le linn do chuairte

source: • Written undertakings from both yourself and your reference, confirming that you will observe the conditions of your visa, that you will not become a burden on the State, and that you will leave the State on the expiration of your permission to remain
ga: • Gealltaí i scríbhinn uaitse agus ó do theisteoir ag dearbhú go gcomhlíonfaidh tú coinníollacha do víosa, agus nach mbeidh tú i d’ualach ar an Stát, agus go bhfágfaidh tú an Stát nuair a bheidh deireadh leis an gcead a bheidh agat fanacht

source: • Details of your relationship to your reference, or how you are known to each other, along with supporting evidence of this
ga: • Sonraí faoin gcaidreamh atá agat le do theisteoir, nó faoin gcaoi a bhfuil aithne agaibh ar a chéile, mar aon le fianaise thacaíochta faoi

source: • If your reference is not an Irish citizen, evidence of their permission to remain in Ireland
ga: • Fianaise go bhfuil cead ag do theisteoir fanacht in Éirinn más rud é nach saoránach de chuid na hÉireann é nó í

source: (That is, a copy of their Certificate of Registration (GNIB card) and copy of their passport showing immigration stamps)
ga: (Is é sin le rá, cóip dá theastas chlárúcháin agus cóip dá p(h)as a léiríonn stampaí inimirce)

source: • Evidence of how you intend to finance your trip and support yourself for the duration of your visit, allowing for any unforeseen events such as illness
ga: • Fianaise faoi gcaoi a bhfuil sé ar intinn agat íoc as do thuras, agus tú féin a chothú lena linn, agus déileáil le rudaí gan choinne mar bhreoiteacht

source: A detailed bank statement, covering a 6 month period immediately prior to your visa application, and showing sufficient funds to cover all costs, is required
ga: Ní mór ráiteas mionsonraithe bainc a sholáthar maidir leis na 6 mhí sin sula gcuireann tú isteach ar víosa, agus a léireoidh go bhfuil airgead go leor agat chun íoc as gach costas

source: • Evidence that you are obliged to return to your country of residence
ga: • Fianaise go bhfuil ort filleadh ar an tír ina gcónaíonn tú

source: This evidence can take the form of a letter from your employer detailing when you are expected to return to work or a letter from a college specifying the date on which your course of study re-commences
ga: Ba leor mar chruthúnas air sin litir ó d’fhostóir ag insint cathain a bhfuiltear ag súil go bhfillfidh tú ar do chuid oibre, nó litir ó choláiste ag tabhairt le fios an dáta a thosóidh do chúrsa staidéir athuair

source: If you do not work or study, a letter from a person in authority may be sufficient
ga: D’fhéadfadh sé gur leor litir ó dhuine a bhfuil post údarásach aige nó aici mura bhfuil tú ag obair nó ag staidéar

source: There is more information on the documentation required for a visit or holiday visa on the website of the Irish Naturalisation and Immigration Service (INIS) of the Department of Justice and Equality
ga: Tá tuilleadh eolais faoi cáipéisíocht riachtanach le haghaidh víosa cuairte/saoire ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann de chuid na Roinne Dlí agus Cirt agus Comhionannais

source: All non-EEA nationals, including those with visas, must obtain permission to enter the State by reporting to an Immigration Officer at the port of entry
ga: Fiú murar gá duit víosa a fháil le teacht go hÉirinn, ní mór do gach náisiúnach nach ó cheann de thíortha LEE iad (fiú iad siúd a bhfuil víosaí acu), dul i dteagmháil le hOifigeach Inimirce ag an bport iontrála le cead a fháil teacht isteach sa Stát

source: The length of time you will be allowed to stay in Ireland is determined by the Immigration Officer but will never exceed a maximum of 90 days
ga: Is é nó í an tOifigeach sin a chinnteoidh an t-achar is féidir leat fanacht in Éirinn ach ní cheadófar tréimhse níos faide ná 90 lá

source: You should have supporting documentation relating to the purpose of your visit on your person when coming through immigration
ga: Ba chóir gach cáipéis thacaíochta a bhaineann le cuspóir do chuairte a bheith agat nuair a thagann tú tríd inimirce

source: You can read more in our document on permission to land in Ireland
ga: Féadfaidh tú tuilleadh a léamh inár ndoiciméad faoi cead tuirlingthe in Éirinn

source: What do I do if I want to leave for a short while?
ga: Céard a dhéanfaidh mé más mian liom imeacht ar feadh tamaill bhig?

source: The visiting/holiday visa issued to you allows you to enter the State once
ga: Tugann an víosa cuairte/saoire a eisítear cead duit teacht isteach sa Stát uair amháin

source: If you have wish to leave for a short while and then return you must apply for a re-entry visa
ga: Caithfidh tú cur isteach ar víosa athiontrála más mian leat imeacht ar feadh tamaill bhig agus filleadh arís

source: (See 'How to apply' below for information on how to apply for a re-entry visa.)
ga: (Féach ar ‘How to apply’ thíos le fáil amach conas iarratas a dhéanamh ar víosa athiontrála.)

source: It is your responsibility to ensure you have the correct visa (if required) for the country you intend travelling to
ga: Is ortsa féin atá sé a chinntiú go bhfuil an víosa ceart agat (más gá ceann) le haghaidh na tíre sin ar mhian leat taisteal chuici

source: Please note that you must obtain a visa from the UK authorities before travelling to Northern Ireland (Counties Antrim, Armagh, Derry, Down, Fermanagh and Tyrone)
ga: Tabhair faoi ndeara le do thoil go gcaithfidh tú víosa a fháil ó údaráis na RA sula dtaistealaíonn tú go Tuaisceart Éireann (Contaetha Aontroma, Ard Mhacha, Dhoire, An Dúin, Fhear Manach agus Thír Eoghain)

source: Information on applying for a visa to visit the UK is available from UK Visas and Immigration
ga: Tá eolais faoi iarratas a dhéanamh ar víosa chun cuairt a thabhairt ar an RA ó Ríocht Aontaithe Víosaí agus Inimirce

source: What do I do after my arrival if I wish to stay in Ireland for longer than 3 months?
ga: Cad a dhéanfaidh mé más mian liom fanacht níos faide ná 3 mhí nuair a shroichim Éire?

source: Visit/holiday visas are only granted for short term stays and never exceed 90 days
ga: Is le haghaidh tréimhsí gearra a thugtar víosaí cuairte/saoire agus ní thugtar iad riamh le haghaidh tréimhsí níos faide ná 90 lá

source: It is not possible to extend your stay beyond 90 days
ga: Ní féidir síneadh a chur leo sa chaoi go mbeidh siad níos faide ná 90 lá

source: You must leave the State on or before the date which has been stamped on your passport by the Immigration Officer when you entered
ga: Caithfidh tú an Stát a fhágáil ar an dáta a stampáil an tOifigeach Inimirce ar do phas nuair a tháinig tú nó roimh an dáta sin

source: Information on those who need a visa to visit Ireland is available in our document: Visa requirements for entering Ireland
ga: Eolas ar iad siúd a bhfuil gá le víosa atá ar fáil sa doiciméad: Riachtanais víosa le teacht isteach in Éirinn

source: You do not require a visa if you are from an EU/EEA member state
ga: Ní gá duit víosa a fháil le cuairt a thabhairt ar Éirinn más más saoránach de chuid an AE/LEE tú

source: Standard non-refundable visa application processing fees are:
ga: Is iad seo a leanas na táillí maidir le próiseáil iarratas ar víosaí

source: Certain applicants are not required to pay a fee
ga: Ní gá d’iarratasóirí áirithe aon táille a íoc

source: They include visa-required spouses and certain family members of EU/EEA citizens
ga: Áirítear leo siúd céilí ar gá dóibh víosaí a bheith acu agus baill theaghlaigh saoránach de chuid an AE/LEE

source: In addition, applicants from some countries are not required to pay a fee
ga: Lena chois sin ní gá d’iarratasóirí ó thíortha áirithe aon táille a íoc

source: As this changes from time to time, you should check with your local Irish embassy or consulate, or with the Visa Office - see 'Where to apply'
ga: Ós rud é go n-athraíonn sé seo ó am go chéile, ba chóir duit ceist a chur ar ambasáid nó ar chonsalacht na hÉireann atá gar duit nó ar an Oifig Víosa - féach ‘Cá háit a dhéanfaidh mé iarratas’

source: Nationals of the countries covered by the Short-stay Visa Waiver Programme who are long-term legal residents of the UK or the Schengen area will still require a visa but will not have to pay the visa fee
ga: Ní gá do náisiúnaigh de na tíortha faoi chumhdach an Chláir Tarscaoilte Víosa Gearrchónaithe, atá ina gcónaí go dlíthiúil sa RA nó sa limistéar Schengen an táille víosa a íoc ach is gá díobh víosa a bheith acu fós

source: You must apply for a visa online
ga: Caithfidh tú iarratas ar víosa a dhéanamh ar líne

source: There is information on how to complete an online application in English (pdf) as well as in Arabic (pdf), Chinese (pdf), Russian (pdf), French (pdf), Turkish (pdf), Hindi (pdf) and Urdu (pdf)
ga: Tá faisnéis faoi conas iarratas a dhéanamh ar líne as Béarla (pdf) agus as Araibis (pdf), as Sínis (pdf), as Rúisis (pdf), as Fraincis (pdf), as Tuircis (pdf), as Hiondúis (pdf) agus as Urdais (pdf)

source: Details of what documents you will need and the photographic requirements are on the Irish Naturalisation and Immigration Service website
ga: Tá sonraí faoi na cáipéisí a bheidh ag teastáil uait agus na riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: The Irish Government has started collecting biometric data from certain visa applicants
ga: Tosaíonn Rialtas na hÉireann sonraí bithmhéadracha ó iarratasóirí víosa áirithe a bhailiú

source: From March 2010 all visa applicants aged 6 years and over residing in Nigeria must provide fingerprints
ga: Ó Márta 2010 ní mór do gach iarratasóir víosa atá os cionn aois 6 agus ina chónaí sa Nigéir, méarloirg a sholáthar

source: You can find information about biometric data on the INIS website
ga: Tá tuilleadh eolais faoi shonraí bithmhéadracha ar fáil ar an suíomh gréasáin SEIÉ

source: The Irish Naturalisation and Immigration Service recommends that you should allow at least 8 weeks for your visa application to be processed
ga: Molann Seirbhís Eadóirseachta agus Inimirce na hÉireann go dtabharfá 8 seachtaine ar a laghad chun d’iarratas ar víosa a phróiseáil

source: Detailed information on the application procedures is available on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: Tá faisnéis mhionsonraithe ar na nósanna imeachta iarratais ar fáil ar láithreán gréasáin na Seirbhíse Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: Applying for a re-entry visas
ga: Cur isteach ar víosaí athiontrála

source: Before applying for a re-entry visa you must register with the local immigration officer for the district in which you are staying (Garda National Immigration Bureau if staying in Dublin)
ga: Sula gcuireann tú isteach ar víosa athiontrála ní mór duit clárú le hoifigeach inimirce an cheantair sin ina bhfuil tú i do chónaí. (Is é sin Biúró Náisiúnta an Gharda Síochána um Inimirce má tá cónaí ort i mBaile Átha Cliath)

source: You can read more about registration in our document on Registration of non-EEA nationals in Ireland
ga: Féadfaidh tú tuilleadh a léamh faoi chlárú inár ndoiciméad faoi Clárú náisiúnach nach den LEE iad in Éirinn

source: Sent your completed Re-Entry Visa Application Form, along with all required documentation, by registered post to the:
ga: Seol an Foirm iarratais le haghaidh víosa athiontrála comhlánaithe mar aon leis an gcáipéisíocht riachtanach go léir trí phost cláraithe chuig:

source: Re-entry Visa Processing Office,
ga: Oifig Próiseála Víosaí Athiontrála,

source: Irish Naturalisation & Immigration Service,
ga: Seirbhís Eadóirseachta agus Inimirce na hÉireann,

source: Apply for your re-entry visa well in advance of your proposed dates of travel
ga: Cuir isteach ar do víosa athiontrála i bhfad roimh na dátaí a bhfuil sé ar intinn agat taisteal

source: Postal applications for re-entry visas will be processed within 4 days of receipt and your re-entry visa will be returned to you by registered post
ga: Déanfar iarratais ar víosaí athiontrála a fhaightear tríd an bpost a phróiseáil laistigh de 4 lá ón am a fhaightear iad, agus cuirfear do víosa athiontrála ar ais chugat trí phost cláraithe

source: If you wish to apply in person at the Visa Office you must book an appointment online
ga: Más mian leat iarratas a dhéanamh go pearsanta chuig Oifig Víosaí, ní mór duit coinne a chur in áirithe ar líne

source: You will need to have a completed application form and all required documentation with you
ga: Beidh ort foirm iarratais chomhlánaithe agus an cháipéisíocht riachtanach go léir a bheith agat

source: There is more information on applying for a re-entry visa, as well as information on photographic requirements on the Irish Naturalisation & Immigration Service website
ga: Tá tuilleadh eolais faoi cur isteach ar víosa athiontrála agus faisnéis faoi riachtanais ghrianghrafadóireachta le fáil ar láithreán gréasáin Sheirbhís Eadóirseachta agus Inimirce na hÉireann. Cá háit a ndéanfaidh mé iarratas Caithfidh tú iarratas ar víosa a dhéanamh ar líne. Ambasáid nó consalacht na hÉireann is gaire duit

source: If you require a visa in order to visit Ireland, your application must be made online
ga: Láithreán Gréasáin: http://www.inis.gov.ie/ R-phost: visamail@justice.ie
